Chapter04/HumanTaskApps/DynamicTaskAssignment/SOA/testsuites/TestData12c.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <ns1:start xmlns:ns1="http://xmlns.oracle.com/bpmn/bpmnProcess/VerificationProcess"
               xmlns:ns2="http://www.Claim4Insurance.org">
      <ns2:Claim>
        <ns2:DeclainClaim>
          <ns2:caseDeclineDate>2014-12-12T00:00:00</ns2:caseDeclineDate>
          <ns2:reason></ns2:reason>
          <ns2:comments></ns2:comments>
        </ns2:DeclainClaim>
        <ns2:Settlement>
          <ns2:offers>
            <ns2:uploadOffer></ns2:uploadOffer>
            <ns2:comment></ns2:comment>
          </ns2:offers>
          <ns2:payments>
            <ns2:paymentMethod></ns2:paymentMethod>
            <ns2:payeeName></ns2:payeeName>
            <ns2:payeeAddress>
              <ns2:locationType></ns2:locationType>
              <ns2:addressLine1></ns2:addressLine1>
              <ns2:addressLine2></ns2:addressLine2>
              <ns2:addressLine3></ns2:addressLine3>
              <ns2:city></ns2:city>
              <ns2:country></ns2:country>
              <ns2:state></ns2:state>
              <ns2:zipCode></ns2:zipCode>
            </ns2:payeeAddress>
            <ns2:memo></ns2:memo>
          </ns2:payments>
          <ns2:faultSubject>New</ns2:faultSubject>
        </ns2:Settlement>
        <ns2:FNOL>
          <ns2:lossType>Glass Gamage</ns2:lossType>
          <ns2:lossDate>2014-12-12T00:00:00</ns2:lossDate>
          <ns2:reportedChannel>CSR</ns2:reportedChannel>
          <ns2:description></ns2:description>
          <ns2:lossAddress>
            <ns2:locationType>650</ns2:locationType>
            <ns2:addressLine1>San Marino</ns2:addressLine1>
            <ns2:addressLine2></ns2:addressLine2>
            <ns2:addressLine3></ns2:addressLine3>
            <ns2:city>Irvine</ns2:city>
            <ns2:country>USA</ns2:country>
            <ns2:state>CA</ns2:state>
            <ns2:zipCode>99922</ns2:zipCode>
          </ns2:lossAddress>
          <ns2:lossDetails>
            <ns2:noOfVehiclesInvolved>1</ns2:noOfVehiclesInvolved>
            <ns2:noOfWitness>1</ns2:noOfWitness>
            <ns2:whoWasDriving>SomeOne</ns2:whoWasDriving>
            <ns2:vehicleTowed></ns2:vehicleTowed>
            <ns2:towingRequest></ns2:towingRequest>
            <ns2:damageDescription></ns2:damageDescription>
            <ns2:injuryDescription></ns2:injuryDescription>
            <ns2:policeReportFiled></ns2:policeReportFiled>
            <ns2:policereportNumber></ns2:policereportNumber>
            <ns2:policeDepartment></ns2:policeDepartment>
          </ns2:lossDetails>
          <ns2:involvedParties>
            <ns2:involvementType>Claimant</ns2:involvementType>
            <ns2:partyDetails>
              <ns2:salutation></ns2:salutation>
              <ns2:fName></ns2:fName>
              <ns2:mName></ns2:mName>
              <ns2:lName></ns2:lName>
              <ns2:maritialStatus></ns2:maritialStatus>
              <ns2:gender></ns2:gender>
              <ns2:SSN></ns2:SSN>
              <ns2:nationality></ns2:nationality>
            </ns2:partyDetails>
          </ns2:involvedParties>
          <ns2:serviceProvider>
            <ns2:providerName></ns2:providerName>
            <ns2:messageSubject></ns2:messageSubject>
            <ns2:messageDetails></ns2:messageDetails>
          </ns2:serviceProvider>
          <ns2:sensitivity>Expert</ns2:sensitivity>
          <ns2:fastTrackFlag>Yes</ns2:fastTrackFlag>
          <ns2:claimValidated>Yes</ns2:claimValidated>
          <ns2:policyDetails>
            <ns2:policyName></ns2:policyName>
            <ns2:policyNumber></ns2:policyNumber>
            <ns2:primaryInsured></ns2:primaryInsured>
            <ns2:insuredItem></ns2:insuredItem>
          </ns2:policyDetails>
          <ns2:organizationUnit>Finance/EastCoastFinOrg</ns2:organizationUnit>
        </ns2:FNOL>
        <ns2:CloseClaimCase>
          <ns2:caseCloseDate>2014-12-12T00:00:00</ns2:caseCloseDate>
          <ns2:reason>NA</ns2:reason>
          <ns2:comments>NA</ns2:comments>
        </ns2:CloseClaimCase>
        <ns2:Appraisal>
          <ns2:examineDamage>
            <ns2:examineDateTime>2014-12-12T00:00:00</ns2:examineDateTime>
            <ns2:address>
              <ns2:locationType></ns2:locationType>
              <ns2:addressLine1></ns2:addressLine1>
              <ns2:addressLine2></ns2:addressLine2>
              <ns2:addressLine3></ns2:addressLine3>
              <ns2:city></ns2:city>
              <ns2:country></ns2:country>
              <ns2:state></ns2:state>
              <ns2:zipCode></ns2:zipCode>
            </ns2:address>
            <ns2:claimantPresent>Yes</ns2:claimantPresent>
            <ns2:photosUploaded>Yes</ns2:photosUploaded>
          </ns2:examineDamage>
          <ns2:vehicalDetails>
            <ns2:vehicalBuild>
              <ns2:registrationVerified>Yes</ns2:registrationVerified>
            </ns2:vehicalBuild>
            <ns2:vehicalDamage>
              <ns2:driverFront></ns2:driverFront>
              <ns2:passangerFront></ns2:passangerFront>
              <ns2:driverSide></ns2:driverSide>
              <ns2:passangerSide></ns2:passangerSide>
              <ns2:driverRear></ns2:driverRear>
              <ns2:passangerRear></ns2:passangerRear>
              <ns2:frontEnd></ns2:frontEnd>
              <ns2:rearEnd></ns2:rearEnd>
              <ns2:roof></ns2:roof>
              <ns2:damage></ns2:damage>
              <ns2:fireDamage></ns2:fireDamage>
              <ns2:interior></ns2:interior>
              <ns2:allPanels></ns2:allPanels>
              <ns2:engine></ns2:engine>
              <ns2:totalLoss></ns2:totalLoss>
              <ns2:window></ns2:window>
              <ns2:windsheild></ns2:windsheild>
              <ns2:underCarriage></ns2:underCarriage>
              <ns2:description></ns2:description>
            </ns2:vehicalDamage>
          </ns2:vehicalDetails>
          <ns2:estimatedCost>
            <ns2:estimationCompleted>Yes</ns2:estimationCompleted>
            <ns2:comment></ns2:comment>
            <ns2:estimationDescription></ns2:estimationDescription>
          </ns2:estimatedCost>
          <ns2:declaration>
            <ns2:declarationDocumentUploaded></ns2:declarationDocumentUploaded>
          </ns2:declaration>
        </ns2:Appraisal>
        <ns2:Evaluation>
          <ns2:track>
            <ns2:fastTrack>
              <ns2:lossDescription></ns2:lossDescription>
              <ns2:proofDocumentsReviewed></ns2:proofDocumentsReviewed>
              <ns2:repairEstimate></ns2:repairEstimate>
            </ns2:fastTrack>
            <ns2:reserve>
              <ns2:reserveAmount></ns2:reserveAmount>
              <ns2:payments></ns2:payments>
              <ns2:outstandingReserve></ns2:outstandingReserve>
              <ns2:lastUpdated></ns2:lastUpdated>
              <ns2:comments></ns2:comments>
            </ns2:reserve>
          </ns2:track>
        </ns2:Evaluation>
      </ns2:Claim>
    </ns1:start>
  </soap:Body>
</soap:Envelope>
